[
    {
        "version": "80", 
        "message": {
            "0": "The API call returned with no errors. In the case of query calls, this can also mean that the operation being queried is complete(see cudaEventQuery() and cudaStreamQuery()).", 
            "1": "The device function being invoked (usually via cudaLaunchKernel()) was not previously configured via the cudaConfigureCall() function.", 
            "2": "The API call failed because it was unable to allocate enough memory to perform the requested operation. ", 
            "3": "The API call failed because the CUDA driver and runtime could not be initialized. ", 
            "4": "An exception occurred on the device while executing a kernel. Common causes include dereferencing an invalid device pointerand accessing out of bounds shared memory. The device cannot be used until cudaThreadExit() is called. All existing device memory allocations are invalid and must be reconstructed if the program is to continue usingCUDA.", 
            "5": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a previous kernel launch failed. This was previously used for device emulation of kernel launches. ", 
            "6": "This indicates that the device kernel took too long to execute. This can only occur if timeouts are enabled - see the deviceproperty kernelExecTimeoutEnabled for more information. This leaves the process in an inconsistent state and any further CUDA work will return the same error.To continue using CUDA, the process must be terminated and relaunched.", 
            "7": "This indicates that a launch did not occur because it did not have appropriate resources. Although this error is similar tocudaErrorInvalidConfiguration, this error usually indicates that the user has attempted to pass too many arguments to the device kernel, or the kernellaunch specifies too many threads for the kernel's register count.", 
            "8": "The requested device function does not exist or is not compiled for the proper device architecture. ", 
            "9": "This indicates that a kernel launch is requesting resources that can never be satisfied by the current device. Requestingmore shared memory per block than the device supports will trigger this error, as will requesting too many threads or blocks.See cudaDeviceProp for more device limitations.", 
            "10": "This indicates that the device ordinal supplied by the user does not correspond to a valid CUDA device. ", 
            "11": "This indicates that one or more of the parameters passed to the API call is not within an acceptable range of values. ", 
            "12": "This indicates that one or more of the pitch-related parameters passed to the API call is not within the acceptable rangefor pitch.", 
            "13": "This indicates that the symbol name/identifier passed to the API call is not a valid name or identifier. ", 
            "14": "This indicates that the buffer object could not be mapped. ", 
            "15": "This indicates that the buffer object could not be unmapped. ", 
            "16": "This indicates that at least one host pointer passed to the API call is not a valid host pointer. ", 
            "17": "This indicates that at least one device pointer passed to the API call is not a valid device pointer. ", 
            "18": "This indicates that the texture passed to the API call is not a valid texture. ", 
            "19": "This indicates that the texture binding is not valid. This occurs if you call cudaGetTextureAlignmentOffset() with an unbound texture.", 
            "20": "This indicates that the channel descriptor passed to the API call is not valid. This occurs if the format is not one of theformats specified by cudaChannelFormatKind, or if one of the dimensions is invalid.", 
            "21": "This indicates that the direction of the memcpy passed to the API call is not one of the types specified by cudaMemcpyKind.", 
            "22": "This error return is deprecated as of CUDA 3.1. Variables in constant memory may now have their address taken by the runtimevia cudaGetSymbolAddress(). This indicated that the user has taken the address of a constant variable, which was forbidden up until the CUDA 3.1 release. ", 
            "23": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture fetch was not able to be performed. This was previously used for device emulation of texture operations. ", 
            "24": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture was not bound for access. This was previously used for device emulation of texture operations. ", 
            "25": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a synchronization operation had failed. This was previously used for some device emulation functions. ", 
            "26": "This indicates that a non-float texture was being accessed with linear filtering. This is not supported by CUDA. ", 
            "27": "This indicates that an attempt was made to read a non-float texture as a normalized float. This is not supported by CUDA. ", 
            "28": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. Mixing of device and device emulation code was not allowed. ", 
            "29": "This indicates that a CUDA Runtime API call cannot be executed because it is being called during process shut down, at a pointin time after CUDA driver has been unloaded.", 
            "30": "This indicates that an unknown internal error has occurred. ", 
            "31": "This error return is deprecated as of CUDA 4.1. This indicates that the API call is not yet implemented. Production releases of CUDA will never return this error. ", 
            "32": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that an emulated device pointer exceeded the 32-bit address range. ", 
            "33": "This indicates that a resource handle passed to the API call was not valid. Resource handles are opaque types like cudaStream_t and cudaEvent_t.", 
            "34": "This indicates that asynchronous operations issued previously have not completed yet. This result is not actually an error,but must be indicated differently than cudaSuccess (which indicates completion). Calls that may return this value include cudaEventQuery() and cudaStreamQuery().", 
            "35": "This indicates that the installed NVIDIA CUDA driver is older than the CUDA runtime library. This is not a supported configuration.Users should install an updated NVIDIA display driver to allow the application to run.", 
            "36": "This indicates that the user has called cudaSetValidDevices(), cudaSetDeviceFlags(), cudaD3D9SetDirect3DDevice(), cudaD3D10SetDirect3DDevice, cudaD3D11SetDirect3DDevice(), or cudaVDPAUSetVDPAUDevice() after initializing the CUDA runtime by calling non-device management operations (allocating memory and launching kernelsare examples of non-device management operations). This error can also be returned if using runtime/driver interoperabilityand there is an existing CUcontext active on the host thread.", 
            "37": "This indicates that the surface passed to the API call is not a valid surface. ", 
            "38": "This indicates that no CUDA-capable devices were detected by the installed CUDA driver. ", 
            "39": "This indicates that an uncorrectable ECC error was detected during execution. ", 
            "40": "This indicates that a link to a shared object failed to resolve. ", 
            "41": "This indicates that initialization of a shared object failed. ", 
            "42": "This indicates that the cudaLimit passed to the API call is not supported by the active device.", 
            "43": "This indicates that multiple global or constant variables (across separate CUDA source files in the application) share thesame string name.", 
            "44": "This indicates that multiple textures (across separate CUDA source files in the application) share the same string name. ", 
            "45": "This indicates that multiple surfaces (across separate CUDA source files in the application) share the same string name. ", 
            "46": "This indicates that all CUDA devices are busy or unavailable at the current time. Devices are often busy/unavailable due touse of cudaComputeModeExclusive, cudaComputeModeProhibited or when long running CUDA kernels have filled up the GPU and are blocking new work from starting. They can also be unavailabledue to memory constraints on a device that already has active CUDA work being performed.", 
            "47": "This indicates that the device kernel image is invalid. ", 
            "48": "This indicates that there is no kernel image available that is suitable for the device. This can occur when a user specifiescode generation options for a particular CUDA source file that do not include the corresponding device configuration.", 
            "49": "This indicates that the current context is not compatible with this the CUDA Runtime. This can only occur if you are usingCUDA Runtime/Driver interoperability and have created an existing Driver context using the driver API. The Driver contextmay be incompatible either because the Driver context was created using an older version of the API, because the Runtime APIcall expects a primary driver context and the Driver context is not primary, or because the Driver context has been destroyed.Please see Interactions with the CUDA Driver API\" for more information.", 
            "50": "This error indicates that a call to cudaDeviceEnablePeerAccess() is trying to re-enable peer addressing on from a context which has already had peer addressing enabled.", 
            "51": "This error indicates that cudaDeviceDisablePeerAccess() is trying to disable peer addressing which has not been enabled yet via cudaDeviceEnablePeerAccess().", 
            "54": "This indicates that a call tried to access an exclusive-thread device that is already in use by a different thread. ", 
            "55": "This indicates profiler is not initialized for this run. This can happen when the application is running with external profilingtools like visual profiler.", 
            "56": "This error return is deprecated as of CUDA 5.0. It is no longer an error to attempt to enable/disable the profiling via cudaProfilerStart or cudaProfilerStop without initialization.", 
            "57": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStart() when profiling is already enabled.", 
            "58": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStop() when profiling is already disabled.", 
            "59": "An assert triggered in device code during kernel execution. The device cannot be used again until cudaThreadExit() is called. All existing allocations are invalid and must be reconstructed if the program is to continue using CUDA.", 
            "60": "This error indicates that the hardware resources required to enable peer access have been exhausted for one or more of thedevices passed to cudaEnablePeerAccess().", 
            "61": "This error indicates that the memory range passed to cudaHostRegister() has already been registered.", 
            "62": "This error indicates that the pointer passed to cudaHostUnregister() does not correspond to any currently registered memory region.", 
            "63": "This error indicates that an OS call failed. ", 
            "64": "This error indicates that P2P access is not supported across the given devices. ", 
            "65": "This error indicates that a device runtime grid launch did not occur because the depth of the child grid would exceed themaximum supported number of nested grid launches.", 
            "66": "This error indicates that a grid launch did not occur because the kernel uses file-scoped textures which are unsupported bythe device runtime. Kernels launched via the device runtime only support textures created with the Texture Object API's.", 
            "67": "This error indicates that a grid launch did not occur because the kernel uses file-scoped surfaces which are unsupported bythe device runtime. Kernels launched via the device runtime only support surfaces created with the Surface Object API's.", 
            "68": "This error indicates that a call to cudaDeviceSynchronize made from the device runtime failed because the call was made at grid depth greater than than either the default (2 levelsof grids) or user specified device limit cudaLimitDevRuntimeSyncDepth. To be able to synchronize on launched grids at a greater depth successfully, the maximum nested depth at which cudaDeviceSynchronize will be called must be specified with the cudaLimitDevRuntimeSyncDepth limit to the cudaDeviceSetLimit api before the host-side launch of a kernel using the device runtime. Keep in mind that additional levels of sync depth requirethe runtime to reserve large amounts of device memory that cannot be used for user allocations.", 
            "69": "This error indicates that a device runtime grid launch failed because the launch would exceed the limit cudaLimitDevRuntimePendingLaunchCount. For this launch to proceed successfully, cudaDeviceSetLimit must be called to set the cudaLimitDevRuntimePendingLaunchCount to be higher than the upper bound of outstanding launches that can be issued to the device runtime. Keep in mind that raisingthe limit of pending device runtime launches will require the runtime to reserve device memory that cannot be used for userallocations.", 
            "70": "This error indicates the attempted operation is not permitted. ", 
            "71": "This error indicates the attempted operation is not supported on the current system or device. ", 
            "72": "Device encountered an error in the call stack during kernel execution, possibly due to stack corruption or exceeding the stacksize limit. This leaves the process in an inconsistent state and any further CUDA work will return the same error. To continueusing CUDA, the process must be terminated and relaunched.", 
            "73": "The device encountered an illegal instruction during kernel execution This leaves the process in an inconsistent state andany further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "74": "The device encountered a load or store instruction on a memory address which is not aligned. This leaves the process in aninconsistent state and any further CUDA work will return the same error. To continue using CUDA, the process must be terminatedand relaunched.", 
            "75": "While executing a kernel, the device encountered an instruction which can only operate on memory locations in certain addressspaces (global, shared, or local), but was supplied a memory address not belonging to an allowed address space. This leavesthe process in an inconsistent state and any further CUDA work will return the same error. To continue using CUDA, the processmust be terminated and relaunched.", 
            "76": "The device encountered an invalid program counter. This leaves the process in an inconsistent state and any further CUDA workwill return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "77": "The device encountered a load or store instruction on an invalid memory address. This leaves the process in an inconsistentstate and any further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched. ", 
            "78": "A PTX compilation failed. The runtime may fall back to compiling PTX if an application does not contain a suitable binaryfor the current device.", 
            "79": "This indicates an error with the OpenGL or DirectX context. ", 
            "80": "This indicates that an uncorrectable NVLink error was detected during the execution. ", 
            "0x7f": "This indicates an internal startup failure in the CUDA runtime. ", 
            "10000": "This error return is deprecated as of CUDA 4.1. Any unhandled CUDA driver error is added to this value and returned via the runtime. Production releases of CUDA should not return such errors. "
        }
    }, 
    {
        "version": "90", 
        "message": {
            "0": "The API call returned with no errors. In the case of query calls, this can also mean that the operation being queried is complete(see cudaEventQuery() and cudaStreamQuery()).", 
            "1": "The device function being invoked (usually via cudaLaunchKernel()) was not previously configured via the cudaConfigureCall() function.", 
            "2": "The API call failed because it was unable to allocate enough memory to perform the requested operation. ", 
            "3": "The API call failed because the CUDA driver and runtime could not be initialized. ", 
            "4": "An exception occurred on the device while executing a kernel. Common causes include dereferencing an invalid device pointerand accessing out of bounds shared memory. The device cannot be used until cudaThreadExit() is called. All existing device memory allocations are invalid and must be reconstructed if the program is to continue usingCUDA.", 
            "5": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a previous kernel launch failed. This was previously used for device emulation of kernel launches. ", 
            "6": "This indicates that the device kernel took too long to execute. This can only occur if timeouts are enabled - see the deviceproperty kernelExecTimeoutEnabled for more information. This leaves the process in an inconsistent state and any further CUDA work will return the same error.To continue using CUDA, the process must be terminated and relaunched.", 
            "7": "This indicates that a launch did not occur because it did not have appropriate resources. Although this error is similar tocudaErrorInvalidConfiguration, this error usually indicates that the user has attempted to pass too many arguments to the device kernel, or the kernellaunch specifies too many threads for the kernel's register count.", 
            "8": "The requested device function does not exist or is not compiled for the proper device architecture. ", 
            "9": "This indicates that a kernel launch is requesting resources that can never be satisfied by the current device. Requestingmore shared memory per block than the device supports will trigger this error, as will requesting too many threads or blocks.See cudaDeviceProp for more device limitations.", 
            "10": "This indicates that the device ordinal supplied by the user does not correspond to a valid CUDA device. ", 
            "11": "This indicates that one or more of the parameters passed to the API call is not within an acceptable range of values. ", 
            "12": "This indicates that one or more of the pitch-related parameters passed to the API call is not within the acceptable rangefor pitch.", 
            "13": "This indicates that the symbol name/identifier passed to the API call is not a valid name or identifier. ", 
            "14": "This indicates that the buffer object could not be mapped. ", 
            "15": "This indicates that the buffer object could not be unmapped. ", 
            "16": "This indicates that at least one host pointer passed to the API call is not a valid host pointer. ", 
            "17": "This indicates that at least one device pointer passed to the API call is not a valid device pointer. ", 
            "18": "This indicates that the texture passed to the API call is not a valid texture. ", 
            "19": "This indicates that the texture binding is not valid. This occurs if you call cudaGetTextureAlignmentOffset() with an unbound texture.", 
            "20": "This indicates that the channel descriptor passed to the API call is not valid. This occurs if the format is not one of theformats specified by cudaChannelFormatKind, or if one of the dimensions is invalid.", 
            "21": "This indicates that the direction of the memcpy passed to the API call is not one of the types specified by cudaMemcpyKind.", 
            "22": "This error return is deprecated as of CUDA 3.1. Variables in constant memory may now have their address taken by the runtimevia cudaGetSymbolAddress(). This indicated that the user has taken the address of a constant variable, which was forbidden up until the CUDA 3.1 release. ", 
            "23": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture fetch was not able to be performed. This was previously used for device emulation of texture operations. ", 
            "24": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture was not bound for access. This was previously used for device emulation of texture operations. ", 
            "25": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a synchronization operation had failed. This was previously used for some device emulation functions. ", 
            "26": "This indicates that a non-float texture was being accessed with linear filtering. This is not supported by CUDA. ", 
            "27": "This indicates that an attempt was made to read a non-float texture as a normalized float. This is not supported by CUDA. ", 
            "28": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. Mixing of device and device emulation code was not allowed. ", 
            "29": "This indicates that a CUDA Runtime API call cannot be executed because it is being called during process shut down, at a pointin time after CUDA driver has been unloaded.", 
            "30": "This indicates that an unknown internal error has occurred. ", 
            "31": "This error return is deprecated as of CUDA 4.1. This indicates that the API call is not yet implemented. Production releases of CUDA will never return this error. ", 
            "32": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that an emulated device pointer exceeded the 32-bit address range. ", 
            "33": "This indicates that a resource handle passed to the API call was not valid. Resource handles are opaque types like cudaStream_t and cudaEvent_t.", 
            "34": "This indicates that asynchronous operations issued previously have not completed yet. This result is not actually an error,but must be indicated differently than cudaSuccess (which indicates completion). Calls that may return this value include cudaEventQuery() and cudaStreamQuery().", 
            "35": "This indicates that the installed NVIDIA CUDA driver is older than the CUDA runtime library. This is not a supported configuration.Users should install an updated NVIDIA display driver to allow the application to run.", 
            "36": "This indicates that the user has called cudaSetValidDevices(), cudaSetDeviceFlags(), cudaD3D9SetDirect3DDevice(), cudaD3D10SetDirect3DDevice, cudaD3D11SetDirect3DDevice(), or cudaVDPAUSetVDPAUDevice() after initializing the CUDA runtime by calling non-device management operations (allocating memory and launching kernelsare examples of non-device management operations). This error can also be returned if using runtime/driver interoperabilityand there is an existing CUcontext active on the host thread.", 
            "37": "This indicates that the surface passed to the API call is not a valid surface. ", 
            "38": "This indicates that no CUDA-capable devices were detected by the installed CUDA driver. ", 
            "39": "This indicates that an uncorrectable ECC error was detected during execution. ", 
            "40": "This indicates that a link to a shared object failed to resolve. ", 
            "41": "This indicates that initialization of a shared object failed. ", 
            "42": "This indicates that the cudaLimit passed to the API call is not supported by the active device.", 
            "43": "This indicates that multiple global or constant variables (across separate CUDA source files in the application) share thesame string name.", 
            "44": "This indicates that multiple textures (across separate CUDA source files in the application) share the same string name. ", 
            "45": "This indicates that multiple surfaces (across separate CUDA source files in the application) share the same string name. ", 
            "46": "This indicates that all CUDA devices are busy or unavailable at the current time. Devices are often busy/unavailable due touse of cudaComputeModeExclusive, cudaComputeModeProhibited or when long running CUDA kernels have filled up the GPU and are blocking new work from starting. They can also be unavailabledue to memory constraints on a device that already has active CUDA work being performed.", 
            "47": "This indicates that the device kernel image is invalid. ", 
            "48": "This indicates that there is no kernel image available that is suitable for the device. This can occur when a user specifiescode generation options for a particular CUDA source file that do not include the corresponding device configuration.", 
            "49": "This indicates that the current context is not compatible with this the CUDA Runtime. This can only occur if you are usingCUDA Runtime/Driver interoperability and have created an existing Driver context using the driver API. The Driver contextmay be incompatible either because the Driver context was created using an older version of the API, because the Runtime APIcall expects a primary driver context and the Driver context is not primary, or because the Driver context has been destroyed.Please see Interactions with the CUDA Driver API\" for more information.", 
            "50": "This error indicates that a call to cudaDeviceEnablePeerAccess() is trying to re-enable peer addressing on from a context which has already had peer addressing enabled.", 
            "51": "This error indicates that cudaDeviceDisablePeerAccess() is trying to disable peer addressing which has not been enabled yet via cudaDeviceEnablePeerAccess().", 
            "54": "This indicates that a call tried to access an exclusive-thread device that is already in use by a different thread. ", 
            "55": "This indicates profiler is not initialized for this run. This can happen when the application is running with external profilingtools like visual profiler.", 
            "56": "This error return is deprecated as of CUDA 5.0. It is no longer an error to attempt to enable/disable the profiling via cudaProfilerStart or cudaProfilerStop without initialization.", 
            "57": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStart() when profiling is already enabled.", 
            "58": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStop() when profiling is already disabled.", 
            "59": "An assert triggered in device code during kernel execution. The device cannot be used again until cudaThreadExit() is called. All existing allocations are invalid and must be reconstructed if the program is to continue using CUDA.", 
            "60": "This error indicates that the hardware resources required to enable peer access have been exhausted for one or more of thedevices passed to cudaEnablePeerAccess().", 
            "61": "This error indicates that the memory range passed to cudaHostRegister() has already been registered.", 
            "62": "This error indicates that the pointer passed to cudaHostUnregister() does not correspond to any currently registered memory region.", 
            "63": "This error indicates that an OS call failed. ", 
            "64": "This error indicates that P2P access is not supported across the given devices. ", 
            "65": "This error indicates that a device runtime grid launch did not occur because the depth of the child grid would exceed themaximum supported number of nested grid launches.", 
            "66": "This error indicates that a grid launch did not occur because the kernel uses file-scoped textures which are unsupported bythe device runtime. Kernels launched via the device runtime only support textures created with the Texture Object API's.", 
            "67": "This error indicates that a grid launch did not occur because the kernel uses file-scoped surfaces which are unsupported bythe device runtime. Kernels launched via the device runtime only support surfaces created with the Surface Object API's.", 
            "68": "This error indicates that a call to cudaDeviceSynchronize made from the device runtime failed because the call was made at grid depth greater than than either the default (2 levelsof grids) or user specified device limit cudaLimitDevRuntimeSyncDepth. To be able to synchronize on launched grids at a greater depth successfully, the maximum nested depth at which cudaDeviceSynchronize will be called must be specified with the cudaLimitDevRuntimeSyncDepth limit to the cudaDeviceSetLimit api before the host-side launch of a kernel using the device runtime. Keep in mind that additional levels of sync depth requirethe runtime to reserve large amounts of device memory that cannot be used for user allocations.", 
            "69": "This error indicates that a device runtime grid launch failed because the launch would exceed the limit cudaLimitDevRuntimePendingLaunchCount. For this launch to proceed successfully, cudaDeviceSetLimit must be called to set the cudaLimitDevRuntimePendingLaunchCount to be higher than the upper bound of outstanding launches that can be issued to the device runtime. Keep in mind that raisingthe limit of pending device runtime launches will require the runtime to reserve device memory that cannot be used for userallocations.", 
            "70": "This error indicates the attempted operation is not permitted. ", 
            "71": "This error indicates the attempted operation is not supported on the current system or device. ", 
            "72": "Device encountered an error in the call stack during kernel execution, possibly due to stack corruption or exceeding the stacksize limit. This leaves the process in an inconsistent state and any further CUDA work will return the same error. To continueusing CUDA, the process must be terminated and relaunched.", 
            "73": "The device encountered an illegal instruction during kernel execution This leaves the process in an inconsistent state andany further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "74": "The device encountered a load or store instruction on a memory address which is not aligned. This leaves the process in aninconsistent state and any further CUDA work will return the same error. To continue using CUDA, the process must be terminatedand relaunched.", 
            "75": "While executing a kernel, the device encountered an instruction which can only operate on memory locations in certain addressspaces (global, shared, or local), but was supplied a memory address not belonging to an allowed address space. This leavesthe process in an inconsistent state and any further CUDA work will return the same error. To continue using CUDA, the processmust be terminated and relaunched.", 
            "76": "The device encountered an invalid program counter. This leaves the process in an inconsistent state and any further CUDA workwill return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "77": "The device encountered a load or store instruction on an invalid memory address. This leaves the process in an inconsistentstate and any further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched. ", 
            "78": "A PTX compilation failed. The runtime may fall back to compiling PTX if an application does not contain a suitable binaryfor the current device.", 
            "79": "This indicates an error with the OpenGL or DirectX context. ", 
            "80": "This indicates that an uncorrectable NVLink error was detected during the execution. ", 
            "81": "This indicates that the PTX JIT compiler library was not found. The JIT Compiler library is used for PTX compilation. Theruntime may fall back to compiling PTX if an application does not contain a suitable binary for the current device.", 
            "82": "This error indicates that the number of blocks launched per grid for a kernel that was launched via either cudaLaunchCooperativeKernel or cudaLaunchCooperativeKernelMultiDevice exceeds the maximum number of blocks as allowed by cudaOccupancyMaxActiveBlocksPerMultiprocessor or cudaOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors as specified by the device attribute cudaDevAttrMultiProcessorCount.", 
            "0x7f": "This indicates an internal startup failure in the CUDA runtime. ", 
            "10000": "This error return is deprecated as of CUDA 4.1. Any unhandled CUDA driver error is added to this value and returned via the runtime. Production releases of CUDA should not return such errors. "
        }
    }, 
    {
        "version": "91", 
        "message": {
            "0": "The API call returned with no errors. In the case of query calls, this can also mean that the operation being queried is complete(see cudaEventQuery() and cudaStreamQuery()).", 
            "1": "The device function being invoked (usually via cudaLaunchKernel()) was not previously configured via the cudaConfigureCall() function.", 
            "2": "The API call failed because it was unable to allocate enough memory to perform the requested operation. ", 
            "3": "The API call failed because the CUDA driver and runtime could not be initialized. ", 
            "4": "An exception occurred on the device while executing a kernel. Common causes include dereferencing an invalid device pointerand accessing out of bounds shared memory. The device cannot be used until cudaThreadExit() is called. All existing device memory allocations are invalid and must be reconstructed if the program is to continue usingCUDA.", 
            "5": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a previous kernel launch failed. This was previously used for device emulation of kernel launches. ", 
            "6": "This indicates that the device kernel took too long to execute. This can only occur if timeouts are enabled - see the deviceproperty kernelExecTimeoutEnabled for more information. This leaves the process in an inconsistent state and any further CUDA work will return the same error.To continue using CUDA, the process must be terminated and relaunched.", 
            "7": "This indicates that a launch did not occur because it did not have appropriate resources. Although this error is similar tocudaErrorInvalidConfiguration, this error usually indicates that the user has attempted to pass too many arguments to the device kernel, or the kernellaunch specifies too many threads for the kernel's register count.", 
            "8": "The requested device function does not exist or is not compiled for the proper device architecture. ", 
            "9": "This indicates that a kernel launch is requesting resources that can never be satisfied by the current device. Requestingmore shared memory per block than the device supports will trigger this error, as will requesting too many threads or blocks.See cudaDeviceProp for more device limitations.", 
            "10": "This indicates that the device ordinal supplied by the user does not correspond to a valid CUDA device. ", 
            "11": "This indicates that one or more of the parameters passed to the API call is not within an acceptable range of values. ", 
            "12": "This indicates that one or more of the pitch-related parameters passed to the API call is not within the acceptable rangefor pitch.", 
            "13": "This indicates that the symbol name/identifier passed to the API call is not a valid name or identifier. ", 
            "14": "This indicates that the buffer object could not be mapped. ", 
            "15": "This indicates that the buffer object could not be unmapped. ", 
            "16": "This indicates that at least one host pointer passed to the API call is not a valid host pointer. ", 
            "17": "This indicates that at least one device pointer passed to the API call is not a valid device pointer. ", 
            "18": "This indicates that the texture passed to the API call is not a valid texture. ", 
            "19": "This indicates that the texture binding is not valid. This occurs if you call cudaGetTextureAlignmentOffset() with an unbound texture.", 
            "20": "This indicates that the channel descriptor passed to the API call is not valid. This occurs if the format is not one of theformats specified by cudaChannelFormatKind, or if one of the dimensions is invalid.", 
            "21": "This indicates that the direction of the memcpy passed to the API call is not one of the types specified by cudaMemcpyKind.", 
            "22": "This error return is deprecated as of CUDA 3.1. Variables in constant memory may now have their address taken by the runtimevia cudaGetSymbolAddress(). This indicated that the user has taken the address of a constant variable, which was forbidden up until the CUDA 3.1 release. ", 
            "23": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture fetch was not able to be performed. This was previously used for device emulation of texture operations. ", 
            "24": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture was not bound for access. This was previously used for device emulation of texture operations. ", 
            "25": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a synchronization operation had failed. This was previously used for some device emulation functions. ", 
            "26": "This indicates that a non-float texture was being accessed with linear filtering. This is not supported by CUDA. ", 
            "27": "This indicates that an attempt was made to read a non-float texture as a normalized float. This is not supported by CUDA. ", 
            "28": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. Mixing of device and device emulation code was not allowed. ", 
            "29": "This indicates that a CUDA Runtime API call cannot be executed because it is being called during process shut down, at a pointin time after CUDA driver has been unloaded.", 
            "30": "This indicates that an unknown internal error has occurred. ", 
            "31": "This error return is deprecated as of CUDA 4.1. This indicates that the API call is not yet implemented. Production releases of CUDA will never return this error. ", 
            "32": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that an emulated device pointer exceeded the 32-bit address range. ", 
            "33": "This indicates that a resource handle passed to the API call was not valid. Resource handles are opaque types like cudaStream_t and cudaEvent_t.", 
            "34": "This indicates that asynchronous operations issued previously have not completed yet. This result is not actually an error,but must be indicated differently than cudaSuccess (which indicates completion). Calls that may return this value include cudaEventQuery() and cudaStreamQuery().", 
            "35": "This indicates that the installed NVIDIA CUDA driver is older than the CUDA runtime library. This is not a supported configuration.Users should install an updated NVIDIA display driver to allow the application to run.", 
            "36": "This indicates that the user has called cudaSetValidDevices(), cudaSetDeviceFlags(), cudaD3D9SetDirect3DDevice(), cudaD3D10SetDirect3DDevice, cudaD3D11SetDirect3DDevice(), or cudaVDPAUSetVDPAUDevice() after initializing the CUDA runtime by calling non-device management operations (allocating memory and launching kernelsare examples of non-device management operations). This error can also be returned if using runtime/driver interoperabilityand there is an existing CUcontext active on the host thread.", 
            "37": "This indicates that the surface passed to the API call is not a valid surface. ", 
            "38": "This indicates that no CUDA-capable devices were detected by the installed CUDA driver. ", 
            "39": "This indicates that an uncorrectable ECC error was detected during execution. ", 
            "40": "This indicates that a link to a shared object failed to resolve. ", 
            "41": "This indicates that initialization of a shared object failed. ", 
            "42": "This indicates that the cudaLimit passed to the API call is not supported by the active device.", 
            "43": "This indicates that multiple global or constant variables (across separate CUDA source files in the application) share thesame string name.", 
            "44": "This indicates that multiple textures (across separate CUDA source files in the application) share the same string name. ", 
            "45": "This indicates that multiple surfaces (across separate CUDA source files in the application) share the same string name. ", 
            "46": "This indicates that all CUDA devices are busy or unavailable at the current time. Devices are often busy/unavailable due touse of cudaComputeModeExclusive, cudaComputeModeProhibited or when long running CUDA kernels have filled up the GPU and are blocking new work from starting. They can also be unavailabledue to memory constraints on a device that already has active CUDA work being performed.", 
            "47": "This indicates that the device kernel image is invalid. ", 
            "48": "This indicates that there is no kernel image available that is suitable for the device. This can occur when a user specifiescode generation options for a particular CUDA source file that do not include the corresponding device configuration.", 
            "49": "This indicates that the current context is not compatible with this the CUDA Runtime. This can only occur if you are usingCUDA Runtime/Driver interoperability and have created an existing Driver context using the driver API. The Driver contextmay be incompatible either because the Driver context was created using an older version of the API, because the Runtime APIcall expects a primary driver context and the Driver context is not primary, or because the Driver context has been destroyed.Please see Interactions with the CUDA Driver API\" for more information.", 
            "50": "This error indicates that a call to cudaDeviceEnablePeerAccess() is trying to re-enable peer addressing on from a context which has already had peer addressing enabled.", 
            "51": "This error indicates that cudaDeviceDisablePeerAccess() is trying to disable peer addressing which has not been enabled yet via cudaDeviceEnablePeerAccess().", 
            "54": "This indicates that a call tried to access an exclusive-thread device that is already in use by a different thread. ", 
            "55": "This indicates profiler is not initialized for this run. This can happen when the application is running with external profilingtools like visual profiler.", 
            "56": "This error return is deprecated as of CUDA 5.0. It is no longer an error to attempt to enable/disable the profiling via cudaProfilerStart or cudaProfilerStop without initialization.", 
            "57": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStart() when profiling is already enabled.", 
            "58": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStop() when profiling is already disabled.", 
            "59": "An assert triggered in device code during kernel execution. The device cannot be used again until cudaThreadExit() is called. All existing allocations are invalid and must be reconstructed if the program is to continue using CUDA.", 
            "60": "This error indicates that the hardware resources required to enable peer access have been exhausted for one or more of thedevices passed to cudaEnablePeerAccess().", 
            "61": "This error indicates that the memory range passed to cudaHostRegister() has already been registered.", 
            "62": "This error indicates that the pointer passed to cudaHostUnregister() does not correspond to any currently registered memory region.", 
            "63": "This error indicates that an OS call failed. ", 
            "64": "This error indicates that P2P access is not supported across the given devices. ", 
            "65": "This error indicates that a device runtime grid launch did not occur because the depth of the child grid would exceed themaximum supported number of nested grid launches.", 
            "66": "This error indicates that a grid launch did not occur because the kernel uses file-scoped textures which are unsupported bythe device runtime. Kernels launched via the device runtime only support textures created with the Texture Object API's.", 
            "67": "This error indicates that a grid launch did not occur because the kernel uses file-scoped surfaces which are unsupported bythe device runtime. Kernels launched via the device runtime only support surfaces created with the Surface Object API's.", 
            "68": "This error indicates that a call to cudaDeviceSynchronize made from the device runtime failed because the call was made at grid depth greater than than either the default (2 levelsof grids) or user specified device limit cudaLimitDevRuntimeSyncDepth. To be able to synchronize on launched grids at a greater depth successfully, the maximum nested depth at which cudaDeviceSynchronize will be called must be specified with the cudaLimitDevRuntimeSyncDepth limit to the cudaDeviceSetLimit api before the host-side launch of a kernel using the device runtime. Keep in mind that additional levels of sync depth requirethe runtime to reserve large amounts of device memory that cannot be used for user allocations.", 
            "69": "This error indicates that a device runtime grid launch failed because the launch would exceed the limit cudaLimitDevRuntimePendingLaunchCount. For this launch to proceed successfully, cudaDeviceSetLimit must be called to set the cudaLimitDevRuntimePendingLaunchCount to be higher than the upper bound of outstanding launches that can be issued to the device runtime. Keep in mind that raisingthe limit of pending device runtime launches will require the runtime to reserve device memory that cannot be used for userallocations.", 
            "70": "This error indicates the attempted operation is not permitted. ", 
            "71": "This error indicates the attempted operation is not supported on the current system or device. ", 
            "72": "Device encountered an error in the call stack during kernel execution, possibly due to stack corruption or exceeding the stacksize limit. This leaves the process in an inconsistent state and any further CUDA work will return the same error. To continueusing CUDA, the process must be terminated and relaunched.", 
            "73": "The device encountered an illegal instruction during kernel execution This leaves the process in an inconsistent state andany further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "74": "The device encountered a load or store instruction on a memory address which is not aligned. This leaves the process in aninconsistent state and any further CUDA work will return the same error. To continue using CUDA, the process must be terminatedand relaunched.", 
            "75": "While executing a kernel, the device encountered an instruction which can only operate on memory locations in certain addressspaces (global, shared, or local), but was supplied a memory address not belonging to an allowed address space. This leavesthe process in an inconsistent state and any further CUDA work will return the same error. To continue using CUDA, the processmust be terminated and relaunched.", 
            "76": "The device encountered an invalid program counter. This leaves the process in an inconsistent state and any further CUDA workwill return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "77": "The device encountered a load or store instruction on an invalid memory address. This leaves the process in an inconsistentstate and any further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched. ", 
            "78": "A PTX compilation failed. The runtime may fall back to compiling PTX if an application does not contain a suitable binaryfor the current device.", 
            "79": "This indicates an error with the OpenGL or DirectX context. ", 
            "80": "This indicates that an uncorrectable NVLink error was detected during the execution. ", 
            "81": "This indicates that the PTX JIT compiler library was not found. The JIT Compiler library is used for PTX compilation. Theruntime may fall back to compiling PTX if an application does not contain a suitable binary for the current device.", 
            "82": "This error indicates that the number of blocks launched per grid for a kernel that was launched via either cudaLaunchCooperativeKernel or cudaLaunchCooperativeKernelMultiDevice exceeds the maximum number of blocks as allowed by cudaOccupancyMaxActiveBlocksPerMultiprocessor or cudaOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors as specified by the device attribute cudaDevAttrMultiProcessorCount.", 
            "0x7f": "This indicates an internal startup failure in the CUDA runtime. ", 
            "10000": "This error return is deprecated as of CUDA 4.1. Any unhandled CUDA driver error is added to this value and returned via the runtime. Production releases of CUDA should not return such errors. "
        }
    }, 
    {
        "version": "92", 
        "message": {
            "0": "The API call returned with no errors. In the case of query calls, this can also mean that the operation being queried is complete(see cudaEventQuery() and cudaStreamQuery()).", 
            "1": "The device function being invoked (usually via cudaLaunchKernel()) was not previously configured via the cudaConfigureCall() function.", 
            "2": "The API call failed because it was unable to allocate enough memory to perform the requested operation. ", 
            "3": "The API call failed because the CUDA driver and runtime could not be initialized. ", 
            "4": "An exception occurred on the device while executing a kernel. Common causes include dereferencing an invalid device pointerand accessing out of bounds shared memory. The device cannot be used until cudaThreadExit() is called. All existing device memory allocations are invalid and must be reconstructed if the program is to continue usingCUDA.", 
            "5": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a previous kernel launch failed. This was previously used for device emulation of kernel launches. ", 
            "6": "This indicates that the device kernel took too long to execute. This can only occur if timeouts are enabled - see the deviceproperty kernelExecTimeoutEnabled for more information. This leaves the process in an inconsistent state and any further CUDA work will return the same error.To continue using CUDA, the process must be terminated and relaunched.", 
            "7": "This indicates that a launch did not occur because it did not have appropriate resources. Although this error is similar tocudaErrorInvalidConfiguration, this error usually indicates that the user has attempted to pass too many arguments to the device kernel, or the kernellaunch specifies too many threads for the kernel's register count.", 
            "8": "The requested device function does not exist or is not compiled for the proper device architecture. ", 
            "9": "This indicates that a kernel launch is requesting resources that can never be satisfied by the current device. Requestingmore shared memory per block than the device supports will trigger this error, as will requesting too many threads or blocks.See cudaDeviceProp for more device limitations.", 
            "10": "This indicates that the device ordinal supplied by the user does not correspond to a valid CUDA device. ", 
            "11": "This indicates that one or more of the parameters passed to the API call is not within an acceptable range of values. ", 
            "12": "This indicates that one or more of the pitch-related parameters passed to the API call is not within the acceptable rangefor pitch.", 
            "13": "This indicates that the symbol name/identifier passed to the API call is not a valid name or identifier. ", 
            "14": "This indicates that the buffer object could not be mapped. ", 
            "15": "This indicates that the buffer object could not be unmapped. ", 
            "16": "This indicates that at least one host pointer passed to the API call is not a valid host pointer. ", 
            "17": "This indicates that at least one device pointer passed to the API call is not a valid device pointer. ", 
            "18": "This indicates that the texture passed to the API call is not a valid texture. ", 
            "19": "This indicates that the texture binding is not valid. This occurs if you call cudaGetTextureAlignmentOffset() with an unbound texture.", 
            "20": "This indicates that the channel descriptor passed to the API call is not valid. This occurs if the format is not one of theformats specified by cudaChannelFormatKind, or if one of the dimensions is invalid.", 
            "21": "This indicates that the direction of the memcpy passed to the API call is not one of the types specified by cudaMemcpyKind.", 
            "22": "This error return is deprecated as of CUDA 3.1. Variables in constant memory may now have their address taken by the runtimevia cudaGetSymbolAddress(). This indicated that the user has taken the address of a constant variable, which was forbidden up until the CUDA 3.1 release. ", 
            "23": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture fetch was not able to be performed. This was previously used for device emulation of texture operations. ", 
            "24": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture was not bound for access. This was previously used for device emulation of texture operations. ", 
            "25": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a synchronization operation had failed. This was previously used for some device emulation functions. ", 
            "26": "This indicates that a non-float texture was being accessed with linear filtering. This is not supported by CUDA. ", 
            "27": "This indicates that an attempt was made to read a non-float texture as a normalized float. This is not supported by CUDA. ", 
            "28": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. Mixing of device and device emulation code was not allowed. ", 
            "29": "This indicates that a CUDA Runtime API call cannot be executed because it is being called during process shut down, at a pointin time after CUDA driver has been unloaded.", 
            "30": "This indicates that an unknown internal error has occurred. ", 
            "31": "This error return is deprecated as of CUDA 4.1. This indicates that the API call is not yet implemented. Production releases of CUDA will never return this error. ", 
            "32": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that an emulated device pointer exceeded the 32-bit address range. ", 
            "33": "This indicates that a resource handle passed to the API call was not valid. Resource handles are opaque types like cudaStream_t and cudaEvent_t.", 
            "34": "This indicates that asynchronous operations issued previously have not completed yet. This result is not actually an error,but must be indicated differently than cudaSuccess (which indicates completion). Calls that may return this value include cudaEventQuery() and cudaStreamQuery().", 
            "35": "This indicates that the installed NVIDIA CUDA driver is older than the CUDA runtime library. This is not a supported configuration.Users should install an updated NVIDIA display driver to allow the application to run.", 
            "36": "This indicates that the user has called cudaSetValidDevices(), cudaSetDeviceFlags(), cudaD3D9SetDirect3DDevice(), cudaD3D10SetDirect3DDevice, cudaD3D11SetDirect3DDevice(), or cudaVDPAUSetVDPAUDevice() after initializing the CUDA runtime by calling non-device management operations (allocating memory and launching kernelsare examples of non-device management operations). This error can also be returned if using runtime/driver interoperabilityand there is an existing CUcontext active on the host thread.", 
            "37": "This indicates that the surface passed to the API call is not a valid surface. ", 
            "38": "This indicates that no CUDA-capable devices were detected by the installed CUDA driver. ", 
            "39": "This indicates that an uncorrectable ECC error was detected during execution. ", 
            "40": "This indicates that a link to a shared object failed to resolve. ", 
            "41": "This indicates that initialization of a shared object failed. ", 
            "42": "This indicates that the cudaLimit passed to the API call is not supported by the active device.", 
            "43": "This indicates that multiple global or constant variables (across separate CUDA source files in the application) share thesame string name.", 
            "44": "This indicates that multiple textures (across separate CUDA source files in the application) share the same string name. ", 
            "45": "This indicates that multiple surfaces (across separate CUDA source files in the application) share the same string name. ", 
            "46": "This indicates that all CUDA devices are busy or unavailable at the current time. Devices are often busy/unavailable due touse of cudaComputeModeExclusive, cudaComputeModeProhibited or when long running CUDA kernels have filled up the GPU and are blocking new work from starting. They can also be unavailabledue to memory constraints on a device that already has active CUDA work being performed.", 
            "47": "This indicates that the device kernel image is invalid. ", 
            "48": "This indicates that there is no kernel image available that is suitable for the device. This can occur when a user specifiescode generation options for a particular CUDA source file that do not include the corresponding device configuration.", 
            "49": "This indicates that the current context is not compatible with this the CUDA Runtime. This can only occur if you are usingCUDA Runtime/Driver interoperability and have created an existing Driver context using the driver API. The Driver contextmay be incompatible either because the Driver context was created using an older version of the API, because the Runtime APIcall expects a primary driver context and the Driver context is not primary, or because the Driver context has been destroyed.Please see Interactions with the CUDA Driver API\" for more information.", 
            "50": "This error indicates that a call to cudaDeviceEnablePeerAccess() is trying to re-enable peer addressing on from a context which has already had peer addressing enabled.", 
            "51": "This error indicates that cudaDeviceDisablePeerAccess() is trying to disable peer addressing which has not been enabled yet via cudaDeviceEnablePeerAccess().", 
            "54": "This indicates that a call tried to access an exclusive-thread device that is already in use by a different thread. ", 
            "55": "This indicates profiler is not initialized for this run. This can happen when the application is running with external profilingtools like visual profiler.", 
            "56": "This error return is deprecated as of CUDA 5.0. It is no longer an error to attempt to enable/disable the profiling via cudaProfilerStart or cudaProfilerStop without initialization.", 
            "57": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStart() when profiling is already enabled.", 
            "58": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStop() when profiling is already disabled.", 
            "59": "An assert triggered in device code during kernel execution. The device cannot be used again until cudaThreadExit() is called. All existing allocations are invalid and must be reconstructed if the program is to continue using CUDA.", 
            "60": "This error indicates that the hardware resources required to enable peer access have been exhausted for one or more of thedevices passed to cudaEnablePeerAccess().", 
            "61": "This error indicates that the memory range passed to cudaHostRegister() has already been registered.", 
            "62": "This error indicates that the pointer passed to cudaHostUnregister() does not correspond to any currently registered memory region.", 
            "63": "This error indicates that an OS call failed. ", 
            "64": "This error indicates that P2P access is not supported across the given devices. ", 
            "65": "This error indicates that a device runtime grid launch did not occur because the depth of the child grid would exceed themaximum supported number of nested grid launches.", 
            "66": "This error indicates that a grid launch did not occur because the kernel uses file-scoped textures which are unsupported bythe device runtime. Kernels launched via the device runtime only support textures created with the Texture Object API's.", 
            "67": "This error indicates that a grid launch did not occur because the kernel uses file-scoped surfaces which are unsupported bythe device runtime. Kernels launched via the device runtime only support surfaces created with the Surface Object API's.", 
            "68": "This error indicates that a call to cudaDeviceSynchronize made from the device runtime failed because the call was made at grid depth greater than than either the default (2 levelsof grids) or user specified device limit cudaLimitDevRuntimeSyncDepth. To be able to synchronize on launched grids at a greater depth successfully, the maximum nested depth at which cudaDeviceSynchronize will be called must be specified with the cudaLimitDevRuntimeSyncDepth limit to the cudaDeviceSetLimit api before the host-side launch of a kernel using the device runtime. Keep in mind that additional levels of sync depth requirethe runtime to reserve large amounts of device memory that cannot be used for user allocations.", 
            "69": "This error indicates that a device runtime grid launch failed because the launch would exceed the limit cudaLimitDevRuntimePendingLaunchCount. For this launch to proceed successfully, cudaDeviceSetLimit must be called to set the cudaLimitDevRuntimePendingLaunchCount to be higher than the upper bound of outstanding launches that can be issued to the device runtime. Keep in mind that raisingthe limit of pending device runtime launches will require the runtime to reserve device memory that cannot be used for userallocations.", 
            "70": "This error indicates the attempted operation is not permitted. ", 
            "71": "This error indicates the attempted operation is not supported on the current system or device. ", 
            "72": "Device encountered an error in the call stack during kernel execution, possibly due to stack corruption or exceeding the stacksize limit. This leaves the process in an inconsistent state and any further CUDA work will return the same error. To continueusing CUDA, the process must be terminated and relaunched.", 
            "73": "The device encountered an illegal instruction during kernel execution This leaves the process in an inconsistent state andany further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "74": "The device encountered a load or store instruction on a memory address which is not aligned. This leaves the process in aninconsistent state and any further CUDA work will return the same error. To continue using CUDA, the process must be terminatedand relaunched.", 
            "75": "While executing a kernel, the device encountered an instruction which can only operate on memory locations in certain addressspaces (global, shared, or local), but was supplied a memory address not belonging to an allowed address space. This leavesthe process in an inconsistent state and any further CUDA work will return the same error. To continue using CUDA, the processmust be terminated and relaunched.", 
            "76": "The device encountered an invalid program counter. This leaves the process in an inconsistent state and any further CUDA workwill return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "77": "The device encountered a load or store instruction on an invalid memory address. This leaves the process in an inconsistentstate and any further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched. ", 
            "78": "A PTX compilation failed. The runtime may fall back to compiling PTX if an application does not contain a suitable binaryfor the current device.", 
            "79": "This indicates an error with the OpenGL or DirectX context. ", 
            "80": "This indicates that an uncorrectable NVLink error was detected during the execution. ", 
            "81": "This indicates that the PTX JIT compiler library was not found. The JIT Compiler library is used for PTX compilation. Theruntime may fall back to compiling PTX if an application does not contain a suitable binary for the current device.", 
            "82": "This error indicates that the number of blocks launched per grid for a kernel that was launched via either cudaLaunchCooperativeKernel or cudaLaunchCooperativeKernelMultiDevice exceeds the maximum number of blocks as allowed by cudaOccupancyMaxActiveBlocksPerMultiprocessor or cudaOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors as specified by the device attribute cudaDevAttrMultiProcessorCount.", 
            "0x7f": "This indicates an internal startup failure in the CUDA runtime. ", 
            "10000": "This error return is deprecated as of CUDA 4.1. Any unhandled CUDA driver error is added to this value and returned via the runtime. Production releases of CUDA should not return such errors. "
        }
    }, 
    {
        "version": "100", 
        "message": {
            "0": "The API call returned with no errors. In the case of query calls, this also means that the operation being queried is complete(see cudaEventQuery() and cudaStreamQuery()).", 
            "1": "The device function being invoked (usually via cudaLaunchKernel()) was not previously configured via the cudaConfigureCall() function.", 
            "2": "The API call failed because it was unable to allocate enough memory to perform the requested operation. ", 
            "3": "The API call failed because the CUDA driver and runtime could not be initialized. ", 
            "4": "An exception occurred on the device while executing a kernel. Common causes include dereferencing an invalid device pointerand accessing out of bounds shared memory. All existing device memory allocations are invalid. To continue using CUDA, theprocess must be terminated and relaunched.", 
            "5": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a previous kernel launch failed. This was previously used for device emulation of kernel launches. ", 
            "6": "This indicates that the device kernel took too long to execute. This can only occur if timeouts are enabled - see the deviceproperty kernelExecTimeoutEnabled for more information. This leaves the process in an inconsistent state and any further CUDA work will return the same error.To continue using CUDA, the process must be terminated and relaunched.", 
            "7": "This indicates that a launch did not occur because it did not have appropriate resources. Although this error is similar tocudaErrorInvalidConfiguration, this error usually indicates that the user has attempted to pass too many arguments to the device kernel, or the kernellaunch specifies too many threads for the kernel's register count.", 
            "8": "The requested device function does not exist or is not compiled for the proper device architecture. ", 
            "9": "This indicates that a kernel launch is requesting resources that can never be satisfied by the current device. Requestingmore shared memory per block than the device supports will trigger this error, as will requesting too many threads or blocks.See cudaDeviceProp for more device limitations.", 
            "10": "This indicates that the device ordinal supplied by the user does not correspond to a valid CUDA device. ", 
            "11": "This indicates that one or more of the parameters passed to the API call is not within an acceptable range of values. ", 
            "12": "This indicates that one or more of the pitch-related parameters passed to the API call is not within the acceptable rangefor pitch.", 
            "13": "This indicates that the symbol name/identifier passed to the API call is not a valid name or identifier. ", 
            "14": "This indicates that the buffer object could not be mapped. ", 
            "15": "This indicates that the buffer object could not be unmapped. ", 
            "16": "This indicates that at least one host pointer passed to the API call is not a valid host pointer. ", 
            "17": "This indicates that at least one device pointer passed to the API call is not a valid device pointer. ", 
            "18": "This indicates that the texture passed to the API call is not a valid texture. ", 
            "19": "This indicates that the texture binding is not valid. This occurs if you call cudaGetTextureAlignmentOffset() with an unbound texture.", 
            "20": "This indicates that the channel descriptor passed to the API call is not valid. This occurs if the format is not one of theformats specified by cudaChannelFormatKind, or if one of the dimensions is invalid.", 
            "21": "This indicates that the direction of the memcpy passed to the API call is not one of the types specified by cudaMemcpyKind.", 
            "22": "This error return is deprecated as of CUDA 3.1. Variables in constant memory may now have their address taken by the runtimevia cudaGetSymbolAddress(). This indicated that the user has taken the address of a constant variable, which was forbidden up until the CUDA 3.1 release. ", 
            "23": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture fetch was not able to be performed. This was previously used for device emulation of texture operations. ", 
            "24": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture was not bound for access. This was previously used for device emulation of texture operations. ", 
            "25": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a synchronization operation had failed. This was previously used for some device emulation functions. ", 
            "26": "This indicates that a non-float texture was being accessed with linear filtering. This is not supported by CUDA. ", 
            "27": "This indicates that an attempt was made to read a non-float texture as a normalized float. This is not supported by CUDA. ", 
            "28": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. Mixing of device and device emulation code was not allowed. ", 
            "29": "This indicates that a CUDA Runtime API call cannot be executed because it is being called during process shut down, at a pointin time after CUDA driver has been unloaded.", 
            "30": "This indicates that an unknown internal error has occurred. ", 
            "31": "This error return is deprecated as of CUDA 4.1. This indicates that the API call is not yet implemented. Production releases of CUDA will never return this error. ", 
            "32": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that an emulated device pointer exceeded the 32-bit address range. ", 
            "33": "This indicates that a resource handle passed to the API call was not valid. Resource handles are opaque types like cudaStream_t and cudaEvent_t.", 
            "34": "This indicates that asynchronous operations issued previously have not completed yet. This result is not actually an error,but must be indicated differently than cudaSuccess (which indicates completion). Calls that may return this value include cudaEventQuery() and cudaStreamQuery().", 
            "35": "This indicates that the installed NVIDIA CUDA driver is older than the CUDA runtime library. This is not a supported configuration.Users should install an updated NVIDIA display driver to allow the application to run.", 
            "36": "This indicates that the user has called cudaSetValidDevices(), cudaSetDeviceFlags(), cudaD3D9SetDirect3DDevice(), cudaD3D10SetDirect3DDevice, cudaD3D11SetDirect3DDevice(), or cudaVDPAUSetVDPAUDevice() after initializing the CUDA runtime by calling non-device management operations (allocating memory and launching kernelsare examples of non-device management operations). This error can also be returned if using runtime/driver interoperabilityand there is an existing CUcontext active on the host thread.", 
            "37": "This indicates that the surface passed to the API call is not a valid surface. ", 
            "38": "This indicates that no CUDA-capable devices were detected by the installed CUDA driver. ", 
            "39": "This indicates that an uncorrectable ECC error was detected during execution. ", 
            "40": "This indicates that a link to a shared object failed to resolve. ", 
            "41": "This indicates that initialization of a shared object failed. ", 
            "42": "This indicates that the cudaLimit passed to the API call is not supported by the active device.", 
            "43": "This indicates that multiple global or constant variables (across separate CUDA source files in the application) share thesame string name.", 
            "44": "This indicates that multiple textures (across separate CUDA source files in the application) share the same string name. ", 
            "45": "This indicates that multiple surfaces (across separate CUDA source files in the application) share the same string name. ", 
            "46": "This indicates that all CUDA devices are busy or unavailable at the current time. Devices are often busy/unavailable due touse of cudaComputeModeExclusive, cudaComputeModeProhibited or when long running CUDA kernels have filled up the GPU and are blocking new work from starting. They can also be unavailabledue to memory constraints on a device that already has active CUDA work being performed.", 
            "47": "This indicates that the device kernel image is invalid. ", 
            "48": "This indicates that there is no kernel image available that is suitable for the device. This can occur when a user specifiescode generation options for a particular CUDA source file that do not include the corresponding device configuration.", 
            "49": "This indicates that the current context is not compatible with this the CUDA Runtime. This can only occur if you are usingCUDA Runtime/Driver interoperability and have created an existing Driver context using the driver API. The Driver contextmay be incompatible either because the Driver context was created using an older version of the API, because the Runtime APIcall expects a primary driver context and the Driver context is not primary, or because the Driver context has been destroyed.Please see Interactions with the CUDA Driver API\" for more information.", 
            "50": "This error indicates that a call to cudaDeviceEnablePeerAccess() is trying to re-enable peer addressing on from a context which has already had peer addressing enabled.", 
            "51": "This error indicates that cudaDeviceDisablePeerAccess() is trying to disable peer addressing which has not been enabled yet via cudaDeviceEnablePeerAccess().", 
            "54": "This indicates that a call tried to access an exclusive-thread device that is already in use by a different thread. ", 
            "55": "This indicates profiler is not initialized for this run. This can happen when the application is running with external profilingtools like visual profiler.", 
            "56": "This error return is deprecated as of CUDA 5.0. It is no longer an error to attempt to enable/disable the profiling via cudaProfilerStart or cudaProfilerStop without initialization.", 
            "57": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStart() when profiling is already enabled.", 
            "58": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStop() when profiling is already disabled.", 
            "59": "An assert triggered in device code during kernel execution. The device cannot be used again. All existing allocations areinvalid. To continue using CUDA, the process must be terminated and relaunched.", 
            "60": "This error indicates that the hardware resources required to enable peer access have been exhausted for one or more of thedevices passed to cudaEnablePeerAccess().", 
            "61": "This error indicates that the memory range passed to cudaHostRegister() has already been registered.", 
            "62": "This error indicates that the pointer passed to cudaHostUnregister() does not correspond to any currently registered memory region.", 
            "63": "This error indicates that an OS call failed. ", 
            "64": "This error indicates that P2P access is not supported across the given devices. ", 
            "65": "This error indicates that a device runtime grid launch did not occur because the depth of the child grid would exceed themaximum supported number of nested grid launches.", 
            "66": "This error indicates that a grid launch did not occur because the kernel uses file-scoped textures which are unsupported bythe device runtime. Kernels launched via the device runtime only support textures created with the Texture Object API's.", 
            "67": "This error indicates that a grid launch did not occur because the kernel uses file-scoped surfaces which are unsupported bythe device runtime. Kernels launched via the device runtime only support surfaces created with the Surface Object API's.", 
            "68": "This error indicates that a call to cudaDeviceSynchronize made from the device runtime failed because the call was made at grid depth greater than than either the default (2 levelsof grids) or user specified device limit cudaLimitDevRuntimeSyncDepth. To be able to synchronize on launched grids at a greater depth successfully, the maximum nested depth at which cudaDeviceSynchronize will be called must be specified with the cudaLimitDevRuntimeSyncDepth limit to the cudaDeviceSetLimit api before the host-side launch of a kernel using the device runtime. Keep in mind that additional levels of sync depth requirethe runtime to reserve large amounts of device memory that cannot be used for user allocations.", 
            "69": "This error indicates that a device runtime grid launch failed because the launch would exceed the limit cudaLimitDevRuntimePendingLaunchCount. For this launch to proceed successfully, cudaDeviceSetLimit must be called to set the cudaLimitDevRuntimePendingLaunchCount to be higher than the upper bound of outstanding launches that can be issued to the device runtime. Keep in mind that raisingthe limit of pending device runtime launches will require the runtime to reserve device memory that cannot be used for userallocations.", 
            "70": "This error indicates the attempted operation is not permitted. ", 
            "71": "This error indicates the attempted operation is not supported on the current system or device. ", 
            "72": "Device encountered an error in the call stack during kernel execution, possibly due to stack corruption or exceeding the stacksize limit. This leaves the process in an inconsistent state and any further CUDA work will return the same error. To continueusing CUDA, the process must be terminated and relaunched.", 
            "73": "The device encountered an illegal instruction during kernel execution This leaves the process in an inconsistent state andany further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "74": "The device encountered a load or store instruction on a memory address which is not aligned. This leaves the process in aninconsistent state and any further CUDA work will return the same error. To continue using CUDA, the process must be terminatedand relaunched.", 
            "75": "While executing a kernel, the device encountered an instruction which can only operate on memory locations in certain addressspaces (global, shared, or local), but was supplied a memory address not belonging to an allowed address space. This leavesthe process in an inconsistent state and any further CUDA work will return the same error. To continue using CUDA, the processmust be terminated and relaunched.", 
            "76": "The device encountered an invalid program counter. This leaves the process in an inconsistent state and any further CUDA workwill return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "77": "The device encountered a load or store instruction on an invalid memory address. This leaves the process in an inconsistentstate and any further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched. ", 
            "78": "A PTX compilation failed. The runtime may fall back to compiling PTX if an application does not contain a suitable binaryfor the current device.", 
            "79": "This indicates an error with the OpenGL or DirectX context. ", 
            "80": "This indicates that an uncorrectable NVLink error was detected during the execution. ", 
            "81": "This indicates that the PTX JIT compiler library was not found. The JIT Compiler library is used for PTX compilation. Theruntime may fall back to compiling PTX if an application does not contain a suitable binary for the current device.", 
            "82": "This error indicates that the number of blocks launched per grid for a kernel that was launched via either cudaLaunchCooperativeKernel or cudaLaunchCooperativeKernelMultiDevice exceeds the maximum number of blocks as allowed by cudaOccupancyMaxActiveBlocksPerMultiprocessor or cudaOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors as specified by the device attribute cudaDevAttrMultiProcessorCount.", 
            "83": "This error indicates that the system is not yet ready to start any CUDA work. To continue using CUDA, verify the system configurationis in a valid state and all required driver daemons are actively running.", 
            "84": "This indicates that a resource required by the API call is not in a valid state to perform the requested operation. ", 
            "127": "This indicates an internal startup failure in the CUDA runtime. ", 
            "900": "The operation is not permitted when the stream is capturing. ", 
            "901": "The current capture sequence on the stream has been invalidated due to a previous error. ", 
            "902": "The operation would have resulted in a merge of two independent capture sequences. ", 
            "903": "The capture was not initiated in this stream. ", 
            "904": "The capture sequence contains a fork that was not joined to the primary stream. ", 
            "905": "A dependency would have been created which crosses the capture sequence boundary. Only implicit in-stream ordering dependenciesare allowed to cross the boundary.", 
            "906": "The operation would have resulted in a disallowed implicit dependency on a current capture sequence from cudaStreamLegacy. ", 
            "907": "The operation is not permitted on an event which was last recorded in a capturing stream. ", 
            "10000": "This error return is deprecated as of CUDA 4.1. Any unhandled CUDA driver error is added to this value and returned via the runtime. Production releases of CUDA should not return such errors. "
        }
    }, 
    {
        "version": "102", 
        "message": {
            "0": "The API call returned with no errors. In the case of query calls, this also means that the operation being queried is complete(see cudaEventQuery() and cudaStreamQuery()).", 
            "1": "This indicates that one or more of the parameters passed to the API call is not within an acceptable range of values. ", 
            "2": "The API call failed because it was unable to allocate enough memory to perform the requested operation. ", 
            "3": "The API call failed because the CUDA driver and runtime could not be initialized. ", 
            "4": "This indicates that a CUDA Runtime API call cannot be executed because it is being called during process shut down, at a pointin time after CUDA driver has been unloaded.", 
            "5": "This indicates profiler is not initialized for this run. This can happen when the application is running with external profilingtools like visual profiler.", 
            "6": "This error return is deprecated as of CUDA 5.0. It is no longer an error to attempt to enable/disable the profiling via cudaProfilerStart or cudaProfilerStop without initialization.", 
            "7": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStart() when profiling is already enabled.", 
            "8": "This error return is deprecated as of CUDA 5.0. It is no longer an error to call cudaProfilerStop() when profiling is already disabled.", 
            "9": "This indicates that a kernel launch is requesting resources that can never be satisfied by the current device. Requestingmore shared memory per block than the device supports will trigger this error, as will requesting too many threads or blocks.See cudaDeviceProp for more device limitations.", 
            "12": "This indicates that one or more of the pitch-related parameters passed to the API call is not within the acceptable rangefor pitch.", 
            "13": "This indicates that the symbol name/identifier passed to the API call is not a valid name or identifier. ", 
            "16": "This error return is deprecated as of CUDA 10.1. This indicates that at least one host pointer passed to the API call is not a valid host pointer. ", 
            "17": "This error return is deprecated as of CUDA 10.1. This indicates that at least one device pointer passed to the API call is not a valid device pointer. ", 
            "18": "This indicates that the texture passed to the API call is not a valid texture. ", 
            "19": "This indicates that the texture binding is not valid. This occurs if you call cudaGetTextureAlignmentOffset() with an unbound texture.", 
            "20": "This indicates that the channel descriptor passed to the API call is not valid. This occurs if the format is not one of theformats specified by cudaChannelFormatKind, or if one of the dimensions is invalid.", 
            "21": "This indicates that the direction of the memcpy passed to the API call is not one of the types specified by cudaMemcpyKind.", 
            "22": "This error return is deprecated as of CUDA 3.1. Variables in constant memory may now have their address taken by the runtimevia cudaGetSymbolAddress(). This indicated that the user has taken the address of a constant variable, which was forbidden up until the CUDA 3.1 release. ", 
            "23": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture fetch was not able to be performed. This was previously used for device emulation of texture operations. ", 
            "24": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a texture was not bound for access. This was previously used for device emulation of texture operations. ", 
            "25": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a synchronization operation had failed. This was previously used for some device emulation functions. ", 
            "26": "This indicates that a non-float texture was being accessed with linear filtering. This is not supported by CUDA. ", 
            "27": "This indicates that an attempt was made to read a non-float texture as a normalized float. This is not supported by CUDA. ", 
            "28": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. Mixing of device and device emulation code was not allowed. ", 
            "31": "This error return is deprecated as of CUDA 4.1. This indicates that the API call is not yet implemented. Production releases of CUDA will never return this error. ", 
            "32": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that an emulated device pointer exceeded the 32-bit address range. ", 
            "35": "This indicates that the installed NVIDIA CUDA driver is older than the CUDA runtime library. This is not a supported configuration.Users should install an updated NVIDIA display driver to allow the application to run.", 
            "37": "This indicates that the surface passed to the API call is not a valid surface. ", 
            "43": "This indicates that multiple global or constant variables (across separate CUDA source files in the application) share thesame string name.", 
            "44": "This indicates that multiple textures (across separate CUDA source files in the application) share the same string name. ", 
            "45": "This indicates that multiple surfaces (across separate CUDA source files in the application) share the same string name. ", 
            "46": "This indicates that all CUDA devices are busy or unavailable at the current time. Devices are often busy/unavailable due touse of cudaComputeModeExclusive, cudaComputeModeProhibited or when long running CUDA kernels have filled up the GPU and are blocking new work from starting. They can also be unavailabledue to memory constraints on a device that already has active CUDA work being performed.", 
            "49": "This indicates that the current context is not compatible with this the CUDA Runtime. This can only occur if you are usingCUDA Runtime/Driver interoperability and have created an existing Driver context using the driver API. The Driver contextmay be incompatible either because the Driver context was created using an older version of the API, because the Runtime APIcall expects a primary driver context and the Driver context is not primary, or because the Driver context has been destroyed.Please see Interactions with the CUDA Driver API\" for more information.", 
            "52": "The device function being invoked (usually via cudaLaunchKernel()) was not previously configured via the cudaConfigureCall() function.", 
            "53": "This error return is deprecated as of CUDA 3.1. Device emulation mode was removed with the CUDA 3.1 release. This indicated that a previous kernel launch failed. This was previously used for device emulation of kernel launches. ", 
            "65": "This error indicates that a device runtime grid launch did not occur because the depth of the child grid would exceed themaximum supported number of nested grid launches.", 
            "66": "This error indicates that a grid launch did not occur because the kernel uses file-scoped textures which are unsupported bythe device runtime. Kernels launched via the device runtime only support textures created with the Texture Object API's.", 
            "67": "This error indicates that a grid launch did not occur because the kernel uses file-scoped surfaces which are unsupported bythe device runtime. Kernels launched via the device runtime only support surfaces created with the Surface Object API's.", 
            "68": "This error indicates that a call to cudaDeviceSynchronize made from the device runtime failed because the call was made at grid depth greater than than either the default (2 levelsof grids) or user specified device limit cudaLimitDevRuntimeSyncDepth. To be able to synchronize on launched grids at a greater depth successfully, the maximum nested depth at which cudaDeviceSynchronize will be called must be specified with the cudaLimitDevRuntimeSyncDepth limit to the cudaDeviceSetLimit api before the host-side launch of a kernel using the device runtime. Keep in mind that additional levels of sync depth requirethe runtime to reserve large amounts of device memory that cannot be used for user allocations.", 
            "69": "This error indicates that a device runtime grid launch failed because the launch would exceed the limit cudaLimitDevRuntimePendingLaunchCount. For this launch to proceed successfully, cudaDeviceSetLimit must be called to set the cudaLimitDevRuntimePendingLaunchCount to be higher than the upper bound of outstanding launches that can be issued to the device runtime. Keep in mind that raisingthe limit of pending device runtime launches will require the runtime to reserve device memory that cannot be used for userallocations.", 
            "98": "The requested device function does not exist or is not compiled for the proper device architecture. ", 
            "100": "This indicates that no CUDA-capable devices were detected by the installed CUDA driver. ", 
            "101": "This indicates that the device ordinal supplied by the user does not correspond to a valid CUDA device. ", 
            "127": "This indicates an internal startup failure in the CUDA runtime. ", 
            "200": "This indicates that the device kernel image is invalid. ", 
            "201": "This most frequently indicates that there is no context bound to the current thread. This can also be returned if the contextpassed to an API call is not a valid handle (such as a context that has had cuCtxDestroy() invoked on it). This can also be returned if a user mixes different API versions (i.e. 3010 context with 3020 API calls).See cuCtxGetApiVersion() for more details.", 
            "205": "This indicates that the buffer object could not be mapped. ", 
            "206": "This indicates that the buffer object could not be unmapped. ", 
            "207": "This indicates that the specified array is currently mapped and thus cannot be destroyed. ", 
            "208": "This indicates that the resource is already mapped. ", 
            "209": "This indicates that there is no kernel image available that is suitable for the device. This can occur when a user specifiescode generation options for a particular CUDA source file that do not include the corresponding device configuration.", 
            "210": "This indicates that a resource has already been acquired. ", 
            "211": "This indicates that a resource is not mapped. ", 
            "212": "This indicates that a mapped resource is not available for access as an array. ", 
            "213": "This indicates that a mapped resource is not available for access as a pointer. ", 
            "214": "This indicates that an uncorrectable ECC error was detected during execution. ", 
            "215": "This indicates that the cudaLimit passed to the API call is not supported by the active device.", 
            "216": "This indicates that a call tried to access an exclusive-thread device that is already in use by a different thread. ", 
            "217": "This error indicates that P2P access is not supported across the given devices. ", 
            "218": "A PTX compilation failed. The runtime may fall back to compiling PTX if an application does not contain a suitable binaryfor the current device.", 
            "219": "This indicates an error with the OpenGL or DirectX context. ", 
            "220": "This indicates that an uncorrectable NVLink error was detected during the execution. ", 
            "221": "This indicates that the PTX JIT compiler library was not found. The JIT Compiler library is used for PTX compilation. Theruntime may fall back to compiling PTX if an application does not contain a suitable binary for the current device.", 
            "300": "This indicates that the device kernel source is invalid. ", 
            "301": "This indicates that the file specified was not found. ", 
            "302": "This indicates that a link to a shared object failed to resolve. ", 
            "303": "This indicates that initialization of a shared object failed. ", 
            "304": "This error indicates that an OS call failed. ", 
            "400": "This indicates that a resource handle passed to the API call was not valid. Resource handles are opaque types like cudaStream_t and cudaEvent_t.", 
            "401": "This indicates that a resource required by the API call is not in a valid state to perform the requested operation. ", 
            "500": "This indicates that a named symbol was not found. Examples of symbols are global/constant variable names, texture names, andsurface names.", 
            "600": "This indicates that asynchronous operations issued previously have not completed yet. This result is not actually an error,but must be indicated differently than cudaSuccess (which indicates completion). Calls that may return this value include cudaEventQuery() and cudaStreamQuery().", 
            "700": "The device encountered a load or store instruction on an invalid memory address. This leaves the process in an inconsistentstate and any further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched. ", 
            "701": "This indicates that a launch did not occur because it did not have appropriate resources. Although this error is similar tocudaErrorInvalidConfiguration, this error usually indicates that the user has attempted to pass too many arguments to the device kernel, or the kernellaunch specifies too many threads for the kernel's register count.", 
            "702": "This indicates that the device kernel took too long to execute. This can only occur if timeouts are enabled - see the deviceproperty kernelExecTimeoutEnabled for more information. This leaves the process in an inconsistent state and any further CUDA work will return the same error.To continue using CUDA, the process must be terminated and relaunched.", 
            "703": "This error indicates a kernel launch that uses an incompatible texturing mode. ", 
            "704": "This error indicates that a call to cudaDeviceEnablePeerAccess() is trying to re-enable peer addressing on from a context which has already had peer addressing enabled.", 
            "705": "This error indicates that cudaDeviceDisablePeerAccess() is trying to disable peer addressing which has not been enabled yet via cudaDeviceEnablePeerAccess().", 
            "708": "This indicates that the user has called cudaSetValidDevices(), cudaSetDeviceFlags(), cudaD3D9SetDirect3DDevice(), cudaD3D10SetDirect3DDevice, cudaD3D11SetDirect3DDevice(), or cudaVDPAUSetVDPAUDevice() after initializing the CUDA runtime by calling non-device management operations (allocating memory and launching kernelsare examples of non-device management operations). This error can also be returned if using runtime/driver interoperabilityand there is an existing CUcontext active on the host thread.", 
            "709": "This error indicates that the context current to the calling thread has been destroyed using cuCtxDestroy, or is a primary context which has not yet been initialized.", 
            "710": "An assert triggered in device code during kernel execution. The device cannot be used again. All existing allocations areinvalid. To continue using CUDA, the process must be terminated and relaunched.", 
            "711": "This error indicates that the hardware resources required to enable peer access have been exhausted for one or more of thedevices passed to cudaEnablePeerAccess().", 
            "712": "This error indicates that the memory range passed to cudaHostRegister() has already been registered.", 
            "713": "This error indicates that the pointer passed to cudaHostUnregister() does not correspond to any currently registered memory region.", 
            "714": "Device encountered an error in the call stack during kernel execution, possibly due to stack corruption or exceeding the stacksize limit. This leaves the process in an inconsistent state and any further CUDA work will return the same error. To continueusing CUDA, the process must be terminated and relaunched.", 
            "715": "The device encountered an illegal instruction during kernel execution This leaves the process in an inconsistent state andany further CUDA work will return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "716": "The device encountered a load or store instruction on a memory address which is not aligned. This leaves the process in aninconsistent state and any further CUDA work will return the same error. To continue using CUDA, the process must be terminatedand relaunched.", 
            "717": "While executing a kernel, the device encountered an instruction which can only operate on memory locations in certain addressspaces (global, shared, or local), but was supplied a memory address not belonging to an allowed address space. This leavesthe process in an inconsistent state and any further CUDA work will return the same error. To continue using CUDA, the processmust be terminated and relaunched.", 
            "718": "The device encountered an invalid program counter. This leaves the process in an inconsistent state and any further CUDA workwill return the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "719": "An exception occurred on the device while executing a kernel. Common causes include dereferencing an invalid device pointerand accessing out of bounds shared memory. Less common cases can be system specific - more information about these cases canbe found in the system specific user guide. This leaves the process in an inconsistent state and any further CUDA work willreturn the same error. To continue using CUDA, the process must be terminated and relaunched.", 
            "720": "This error indicates that the number of blocks launched per grid for a kernel that was launched via either cudaLaunchCooperativeKernel or cudaLaunchCooperativeKernelMultiDevice exceeds the maximum number of blocks as allowed by cudaOccupancyMaxActiveBlocksPerMultiprocessor or cudaOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors as specified by the device attribute cudaDevAttrMultiProcessorCount.", 
            "800": "This error indicates the attempted operation is not permitted. ", 
            "801": "This error indicates the attempted operation is not supported on the current system or device. ", 
            "802": "This error indicates that the system is not yet ready to start any CUDA work. To continue using CUDA, verify the system configurationis in a valid state and all required driver daemons are actively running. More information about this error can be found inthe system specific user guide.", 
            "803": "This error indicates that there is a mismatch between the versions of the display driver and the CUDA driver. Refer to thecompatibility documentation for supported versions.", 
            "804": "This error indicates that the system was upgraded to run with forward compatibility but the visible hardware detected by CUDAdoes not support this configuration. Refer to the compatibility documentation for the supported hardware matrix or ensurethat only supported hardware is visible during initialization via the CUDA_VISIBLE_DEVICES environment variable.", 
            "900": "The operation is not permitted when the stream is capturing. ", 
            "901": "The current capture sequence on the stream has been invalidated due to a previous error. ", 
            "902": "The operation would have resulted in a merge of two independent capture sequences. ", 
            "903": "The capture was not initiated in this stream. ", 
            "904": "The capture sequence contains a fork that was not joined to the primary stream. ", 
            "905": "A dependency would have been created which crosses the capture sequence boundary. Only implicit in-stream ordering dependenciesare allowed to cross the boundary.", 
            "906": "The operation would have resulted in a disallowed implicit dependency on a current capture sequence from cudaStreamLegacy. ", 
            "907": "The operation is not permitted on an event which was last recorded in a capturing stream. ", 
            "908": "A stream capture sequence not initiated with the cudaStreamCaptureModeRelaxed argument to cudaStreamBeginCapture was passed to cudaStreamEndCapture in a different thread.", 
            "909": "This indicates that the wait operation has timed out. ", 
            "910": "This error indicates that the graph update was not performed because it included changes which violated constraints specificto instantiated graph update.", 
            "999": "This indicates that an unknown internal error has occurred. ", 
            "10000": "This error return is deprecated as of CUDA 4.1. Any unhandled CUDA driver error is added to this value and returned via the runtime. Production releases of CUDA should not return such errors. "
        }
    }
]
